<template>
  <div class="one_stop_wrap main_wrap">
    <div class="content_wrap">
      <div class="header_wrap">
        <Publichead
          :activeIndex="headerArr.activeIndex"
          :logo_url="headerArr.logo_url"
          @handleSelect="handleSelect"
        ></Publichead>
      </div>
      <div class="content_main">
        <div class="header_search_wrap">
          <el-row class="search_inpu_one">
            <el-col :span="1" id="modelname" class="onestopSearch" style="margin-left: 10px;">
              <span class="onestoptxt">情感分类</span>
            </el-col>
            <el-col :span="1" id="dropbox" class="onestopSearch" style="margin-left: 10px;">
              <el-select v-model="select" class="search_select_wrap" @change="(item)=>titleChange(item,'select')">
                <el-option label="默认" value="1"></el-option>
                <el-option label="酒店评论正向训练集" value="training-pos"></el-option>
                <el-option label="酒店评论负向训练集" value="training-neg"></el-option>
                <el-option label="酒店评论测试集" value="test"></el-option>
                <!-- <el-option label="文号" value="documentno"></el-option> -->
              </el-select>
            </el-col>
            <el-col :span="18" id="onestopSearch" class="onestopSearch">
              <el-input
                :placeholder="select == '1'? '请输入待分析内容':'请输入待分析内容'"
                clearable
                v-model="keyword"
                class="input-with-select search_input_wrap"
                prefix-icon="el-icon-search"
                @keyup.enter.native="getList"
                @clear="getList"
                :rows="15"
                type="textarea"
              >
              </el-input>
            </el-col>
            <el-col :span='3'>
              <el-button style="float:left" type="primary" class="primary-btn-main" @click="getList">开始分析</el-button>
            </el-col>
          </el-row>
          <el-row>
            <el-col class="radio_main_wrap">
              <ul>
                <!-- <li class="radio_qing_mo">
                    <el-radio v-model="radio_fuzzy" label="1">精确</el-radio>
                    <el-radio v-model="radio_fuzzy" label="2">模糊</el-radio>
                </li> -->
              </ul>
            </el-col>
          </el-row>
          <el-row>
            <div class="breadcrumb">
                        <span>
                            <a href="#/">首页</a>
                        </span>
              <span>
                            <i>></i>
                            <a href="#/pubwsent">pubwsent情感分类</a>
                        </span>
            </div>
          </el-row>
        </div>
        <div class="center_wrap">
          <el-container>
            <el-aside width="210px">
              <div class="nav_left_wrap onstopSearch_left_nav"
                   :style="navBarFixed ? 'position: fixed;top: 150px;z-index: 666;' : ''"
                   @click="goToAim($event)">
                <div data-v-21e53028 id="label_daohang">导航</div>
                <!-- <div class="searchWhole">
                    <div class="searchWholeTitle">
                        全部
                    </div>
                    <ul class="catagoryWhole">
                        <li>
                            法律法规（{{total_law}}）
                        </li>
                        <li>
                            司法案例（{{total_exp}}）
                        </li>
                        <li>
                            法学期刊（{{total_jou}}）
                        </li>
                    </ul>
                </div> -->
                <el-timeline>
                  <el-timeline-item color="#4084f0" id="0">
                    全部
                  </el-timeline-item>
                  <el-timeline-item color="#4084f0" id="1">
                    情感分类
                    ({{navbarVal.chl ? navbarVal.chl + navbarVal.lar + navbarVal.protocol
                    + navbarVal.lawexplanation + navbarVal.whitebook + navbarVal.workreport
                    + navbarVal.legislation + navbarVal.eagn + navbarVal.iel + navbarVal.hkd
                    + navbarVal.aom + navbarVal.twd : 0}})
                  </el-timeline-item>
                  <!--                  <el-timeline-item color="#4084f0" id="2">-->
                  <!--                    司法案例-->
                  <!--                    ({{navbarVal.pfnl ? navbarVal.pfnl + navbarVal.payz + exampleNavbar.gac-->
                  <!--                    + navbarVal.bankruptcy + navbarVal.pal + navbarVal.atr : 0}})-->
                  <!--                  </el-timeline-item>-->
                  <!--                  <el-timeline-item color="#4084f0" id="3">-->
                  <!--                    法学期刊-->
                  <!--                    ({{navbarVal.qikan ? navbarVal.qikan : 0}})-->
                  <!--                  </el-timeline-item>-->
                </el-timeline>
              </div>
            </el-aside>
            <el-main class="onstopmain">
              <template>
                <div class="content_main_wrap">
                  <div class="lawsNew_wrap" id="lawsNew_wrap_main"
                       v-loading="lawsShowLoad"
                       element-loading-text="拼命加载中"
                       element-loading-spinner="el-icon-loading"
                       element-loading-background="rgba(0, 0, 0, 0)">
                    <div id="textExample">情感分类:请输入以回车分隔的多个文本，模型返回情感分类结果</div>
                    <div class="nerong_wrap">
                      <!--                      <el-row class="tab_nav_wrap">-->
                      <!--                        <el-menu-->
                      <!--                          default-active="chl"-->
                      <!--                          class="el-menu-vertical-demo"-->
                      <!--                          background-color="#fff"-->
                      <!--                          text-color="#666"-->
                      <!--                          active-text-color="#065d9d"-->
                      <!--                          mode="horizontal"-->
                      <!--                          @select="selectIndex"-->
                      <!--                        >-->
                      <!--                          <el-menu-item index="chl">-->
                      <!--                            <span slot="title">中央法规({{navbarVal.chl}})</span>-->
                      <!--                          </el-menu-item>-->
                      <!--                          <el-menu-item index="lar">-->
                      <!--                            <span slot="title">地方法规({{navbarVal.lar}})</span>-->
                      <!--                          </el-menu-item>-->
                      <!--                          <el-submenu index="protocol">-->
                      <!--                            <template slot="title">立法资料</template>-->
                      <!--                            <el-menu-item index="protocol" style="color:#5c79b0;">草案({{navbarVal.protocol}})</el-menu-item>-->
                      <!--                            <el-menu-item index="lawexplanation" style="color:#5c79b0;">法规解读({{navbarVal.lawexplanation}})</el-menu-item>-->
                      <!--                            <el-menu-item index="whitebook" style="color:#5c79b0;">白皮书({{navbarVal.whitebook}})</el-menu-item>-->
                      <!--                            <el-menu-item index="workreport" style="color:#5c79b0;">工作报告({{navbarVal.workreport}})</el-menu-item>-->
                      <!--                          </el-submenu>-->
                      <!--                          <el-menu-item index="legislation">-->
                      <!--                            <span slot="title">立法计划({{navbarVal.legislation}})</span>-->
                      <!--                          </el-menu-item>-->
                      <!--                          <el-menu-item index="eagn">-->
                      <!--                            <span slot="title">中外条约({{navbarVal.eagn}})</span>-->
                      <!--                          </el-menu-item>-->
                      <!--                          <el-menu-item index="iel">-->
                      <!--                            <span slot="title">外国法规({{navbarVal.iel}})</span>-->
                      <!--                          </el-menu-item>-->
                      <!--                          <el-menu-item index="hkd">-->
                      <!--                            <span slot="title">香港法规({{navbarVal.hkd}})</span>-->
                      <!--                          </el-menu-item>-->
                      <!--                          <el-menu-item index="aom">-->
                      <!--                            <span slot="title">澳门法规({{navbarVal.aom}})</span>-->
                      <!--                          </el-menu-item>-->
                      <!--                          <el-menu-item index="twd">-->
                      <!--                            <span slot="title">台湾法规({{navbarVal.twd}})</span>-->
                      <!--                          </el-menu-item>-->
                      <!--                        </el-menu>-->
                      <!--                      </el-row>-->
                      <div class="list_wrap_main">
                        <template v-if="total_law == 0">
                          <div class="no_data_wrap">
                            <img :src="no_data_logo" alt="未查询到相关数据">
                            <p class="one">未查询到相关数据</p>
                            <p class="two">建议您修改相关查询条件重新查询</p>
                          </div>
                        </template>
                        <template v-if="total_law > 0">
                          <div class="content_mian_wrap_one" v-for="(item,index) in segsList.data.opn" :key="index">
                            <div class="circle"></div>
                            <div class="contentTitle_onestop">
                              {{originList[index]}}
                            </div>
                            <div class="contentCon">
                              {{item}}
                              <!--                              <template v-if="item.TimelinessDic">-->
                              <!--                                <span v-html="item.TimelinessDic"></span> /-->
                              <!--                              </template>-->
                              <!--                              <template v-if="item.DocumentNO">-->
                              <!--                                <span v-html="item.DocumentNO"></span> /-->
                              <!--                              </template>-->
                              <!--                              <template v-if="item.IssueDate">-->
                              <!--                                <span v-html="item.IssueDate"></span>发布-->
                              <!--                                <template v-if="item.ImplementDate"> / </template>-->
                              <!--                              </template>-->
                              <!--                              <template v-if="item.ImplementDate">-->
                              <!--                                <span v-html="item.ImplementDate"></span>实施-->
                              <!--                              </template>-->
                              <!-- <span v-if="item.DocumentNO && choseType_law != 'twd'">{{item.DocumentNO}} / </span>
                              <span v-if="item.DocumentNO && choseType_law == 'twd'">{{item.DocumentNO}} </span>
                              <span v-if="item.IssueDate">{{item.IssueDate}}发布 </span>
                              <span v-if="item.ImplementDate"> / {{item.ImplementDate}}实施</span> -->
                            </div>
                          </div>
                        </template>
                        <template v-if="total_law > 0 && !lawsShow">
                          <div class="clickMore">
                            <el-button type="primary" plain @click="clickMoreMethod">点击查看更多</el-button>
                          </div>
                        </template>
                        <template v-if="total_law > 0 && lawsShow">
                          <div class="pagination_onestop">
                            <el-pagination
                              @size-change="handleSizeChange"
                              @current-change="handleCurrentChange"
                              :current-page="lawsForm.page"
                              :page-sizes="[10, 50, 100, 200,400]"
                              :page-size="lawsForm.size"
                              layout="prev, pager, next,sizes,jumper,->,total,slot"
                              background
                              :total="lawsList.total"
                            ></el-pagination>
                          </div>
                        </template>
                      </div>
                    </div>
                  </div>
                </div>
              </template>
            </el-main>
          </el-container>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
    import Publichead from "@/components/headerCommon";
    import {getZYLawSelect} from "../select_api";
    import {getAggs, getCases, addSearch, getJSON, getCollectList} from "../api";

    export default {
        name: "pubwsent",
        components: {
            Publichead
        },
        data() {
            return {
                navbarVal: {
                    lawsTotal: 0,
                    exampleTotal: 0,
                    journalTotal: 0
                },
                scroll: '',// 是否滚动
                navBarFixed: false,
                keyword: "", //搜索框
                select: '1',//搜索范围选中
                no_data_logo: '../static/img/no_data.png',
                //是否模糊查询 2 模糊 1精确
                radio_fuzzy: "1",
                radio_type: "",
                headerArr: {
                    activeIndex: "",
                    logo_url: "../../static/img/logoo.png"
                },
                lawsList: [],
                originList: [],
                segsList: [],
                exampleList: [],
                journalList: [],
                journalNavbar: {},
                lawsNavbar: {},
                exampleNavbar: {},
                rawsentences: {
                    sents: ''
                },
                lawsForm: {
                    scope: "default", //顶部搜索框作用域
                    sort: "date", //排序规则
                    page: 1, //分页页码
                    size: 10, //分页大小，
                    index: "chl", //索引标识
                    keyword: "", //顶部检索框字段值
                    group: false, //是否分组查询(仅中央和地方)
                    title: "", //右下侧结果中检索字段值
                    orderByIndex: 0,
                    groupByIndex: 2,
                    filterList: [],
                    modules: [
                        1,
                        2,
                        3 //右下侧结果列表
                    ],
                    tagJson: [],
                },
                exampleForm: {
                    scope: "title", //顶部搜索框作用域
                    sort: "date", //排序规则
                    page: 1, //分页页码
                    size: 10, //分页大小，
                    index: "pfnl", //索引标识
                    keyword: "", //顶部检索框字段值
                    group: false, //是否分组查询(仅中央和地方)
                    title: "", //右下侧结果中检索字段值
                    orderByIndex: 0,
                    groupByIndex: 2,
                    filterList: [],
                    modules: [
                        1,
                        2,
                        3 //右下侧结果列表
                    ],
                    tagJson: [],
                },
                qikanForm: {
                    scope: "title", //顶部搜索框作用域
                    sort: "date", //排序规则
                    page: 1, //分页页码
                    size: 10, //分页大小，
                    index: "qikan", //索引标识
                    keyword: "", //顶部检索框字段值
                    group: false, //是否分组查询(仅中央和地方)
                    title: "", //右下侧结果中检索字段值
                    orderByIndex: 0,
                    groupByIndex: 2,
                    filterList: [],
                    modules: [
                        1,
                        2,
                        3 //右下侧结果列表
                    ],
                    tagJson: [],
                },
                choseType_law: 'chl',
                choseType_ex: 'pfnl',
                choseType_jou: 'qikan',
                total_law: -1,
                total_exp: -1,
                total_jou: -1,
                lawsShow: true,//默认分页不显示
                jouralShow: true,
                exampleShow: true,
                //加载
                lawsShowLoad: false,
                jouralShowLoad: true,
                exampleShowLoad: true,
                typeScope: 'title',
                //分库数量
                total_eagn: 0,
                total_iel: 0,
                total_hkd: 0,
                total_aom: 0,
                total_legislation: 0,
                total_twd: 0,
                total_protocol: 0,
                total_lawexplanation: 0,
                total_whitebook: 0,
                total_workreport: 0,
                total_chl: 0,
                total_lar: 0,
                total_pfnl: 0,
                total_payz: 0,
                total_gac: 0,
                total_bankruptcy: 0,
                total_pal: 0,
                total_atr: 0,
            }
        },
        created: function () {
            document.title = this.$route.meta.title;
            this.keyword = this.$route.params.keyword;

            //360 搜索传词
            // 获取页面url
            var curUrl = window.location.href
            var curIndex = curUrl.lastIndexOf("?");
            if (curIndex != -1) {
                // 获取问号后面参数
                var targetData = curUrl.substring(curIndex + 1, curUrl.length)
                // 将问号后面参数转换成json
                var objJson = {}
                targetData.split("&").forEach((item) => {
                    objJson[item.split("=")[0]] = item.split("=")[1]
                })
                console.log('--------------搜索传参-----------------', objJson);
                for (let curItem in objJson) {
                    // console.log(curItem)
                }
                let curKeyword_360 = decodeURIComponent(objJson.q) == undefined ? "" : decodeURIComponent(objJson.q);
                this.keyword = curKeyword_360;
                sessionStorage.setItem("curKeyword_360", curKeyword_360);
                // localStorage.setItem("curKeyword_360", curKeyword_360);

                // maybe
                // // base64加密的数据
                // var Base64 = require('js-base64').Base64;
                // if (objJson.yhxx != undefined) {
                //     // 用户信息
                //     var token = objJson.yhxx;
                //     // console.log(token)
                //     if(token.lastIndexOf('/') == token.length - 1){
                //         token=token.substring(0,token.lastIndexOf('/'));
                //     }
                //     // console.log(token)
                //     var userInfo = JSON.parse(decodeURIComponent(Base64.decode(decodeURIComponent(token))));
                //     // 部门受案号
                //     var bmsah = decodeURIComponent(Base64.decode(decodeURIComponent(objJson.bmsah)));
                //     let tandu = {
                //         token: userInfo.dlrdwbm,//登录人单位编码
                //         userId: userInfo.rybm,//人员编码
                //         ryxm:userInfo.ryxm,//人员姓名
                //         dlrbmbm:userInfo.dlrbmbm,//登录人员部门编码
                //         bmsah:bmsah//案件部门受案号
                //     };
                //     sessionStorage.setItem("tandu", JSON.stringify(tandu));
                //     sessionStorage.setItem("obj", JSON.stringify(objJson));
                // }
            }

            // this.lawsForm.keyword=this.keyword;
            // this.exampleForm.keyword=this.keyword;
            // this.qikanForm.keyword=this.keyword;
            // this.searchMethod_law(this.lawsForm);
            // this.searchMethod_exp(this.exampleForm);
            // this.searchMethod_jou(this.qikanForm);
        },
        methods: {
            //搜索范围更改
            titleChange(val, trpe) {

                if (val == "1" || val == 1) {
                    this.keyword = ''
                } else if (val == "training-pos") {
                    this.keyword = '商务大床房，房间很大，床有2M宽，整体感觉经济实惠不错!\n' +
                        '宾馆在小街道上，不大好找，但还好北京热心同胞很多~\n' +
                        '宾馆设施跟介绍的差不多，房间很小，确实挺小，但加上低价位因素，还是无超所值的；\n' +
                        '环境不错，就在小胡同内，安静整洁，暖气好足-_-||。。。呵\n' +
                        '还有一大优势就是从宾馆出发，步行不到十分钟就可以到梅兰芳故居等等，京味小胡同，北海距离好近呢。\n' +
                        '总之，不错。\n' +
                        '推荐给节约消费的自助游朋友~比较划算，附近特色小吃很多~\n' +
                        'CBD中心,周围没什么店铺,说5星有点勉强.不知道为什么卫生间没有电吹风\n' +
                        '总的来说，这样的酒店配这样的价格还算可以，希望他赶快装修，给我的客人留些好的印象\n' +
                        '价格比比较不错的酒店。这次免费升级了，感谢前台服务员。房子还好，地毯是新的，比上次的好些。早餐的人很多要早去些。\n' +
                        '入住丽晶，感觉很好。因为是新酒店，的确有淡淡的油漆味， 房间内较新。房间大小合适，卫生间设备齐全，服务态度也很好。网速可能是提升了吧，感觉还好。有免费的插线板、水果刀。。。等一系列的日常用品免费提供，很细心。晚上的自助餐是每人68元，菜品一般、就算说的过去吧。酒店外有西贝筱面等几家饭馆。西贝的菜实在是量大的惊人，人多在酒店吃就不如去西贝吃了。酒店21：30-24点有广式晚茶，吃过几次，味道正宗，就是点心品种略少。哈。\n' +
                        '酒店地处青山区，包头分昆区、青山区。相对来说：昆区是最繁华的，青山区次之。像包百等大商场全在昆区，从酒店打车到包百商圈车费12元多。青山区也有一个王府井百货，相对来说比包百商圈的略小，从酒店打车8元多。银河广场离酒店有一段距离，打车9、10元吧，银河广场边上有“科丽珑”24小时营业的超市。酒店一楼有小卖部，周围基本没有超市。\n' +
                        '这次住正赶上有几家公司在这里开会，有时楼道里略吵，晚上还有几次有人敲错门，理论上与酒店管理没关系吧。希望以后还是尽量让会议团体住在一层，也许这样可以好些吧。总体感觉丽晶很好，以后来包头还会住这里。\n' +
                        '1。酒店比较新，装潢和设施还不错，只是房间有些油漆味。\n' +
                        '2。早餐还可以，只是品种不是很多。\n' +
                        '3。交通比较方便，周围的小饭店比较多。\n' +
                        '早餐很丰富，服务也热情，早上很早退房时，前台值此人员办理手续也非常快．\n' +
                        '好像跟洪崖洞酒店一个公司的，所以房间的风格比较接近，就是小一些，整体来说比较不错，房间内食品都是免费，很实在。就是早餐实在不敢恭维，大堂环境比较差。整体来说不错，属于比较好的三星级酒店。\n' +
                        '前台　楼层服务员都不错，房间安静整洁，交通方便，吃的周围也挺多．唯一不足，卫生间地漏设计不好，导致少量积水．\n' +
                        '这个宾馆总体感觉还不错，无论从价格、出行、购物，还是订机票（国航就在它的右边）都很方便。\n' +
                        '只是房间没有什么电脑，也不知道它说的免费上网在什么地方可以。\n' +
                        '补充点评 2007年10月12日 ： 对了，去机场也很方便，机场大巴就在它下面，每半个小时一趟\n' +
                        '价格偏高,服务一般.窗外风景ok.早餐还不错\n' +
                        '酒店正在申定五星中，不过目前看来四星都有点勉强。\n' +
                        '大堂很气派，不过细节很粗糙。硬件需要加强。服务人员礼貌热情。\n' +
                        '酒店的房间和早餐都还不错。\n' +
                        '闹中取静的一个地方，在窗前能看到不错的风景。酒店价格的确有些偏高\n' +
                        '价格偏高,好象连云港这地方的酒店都偏贵.早饭不好.房间还不错,窗外风景还行.最重要是房间的窗户很隔音.床小,还是明珠万豪的床好些.\n' +
                        '知道网线接口在哪儿吗？比高家庄的地道口还隐蔽。在床头柜后面！想不道吧？看你怎么用。1：自带4米以上网线；2：自带小板凳：3：房间的垃圾桶可翻过来坐......\n' +
                        '沈阳市政府的酒店，比较大气，交通便利，出门往左就是北陵公园，环境好。\n' +
                        '政府酒店感觉很气派,而且很干净,整个酒店的房间布局也很整齐.5月份入住的,由于第一天房间不能上网,和前台协调又换了一间可以上网的,还帮忙调试了笔记本,服务很周到.正好住的两天都有人结婚,感觉酒店一楼的宴会厅很适合婚礼\n' +
                        '6月下旬去丹东，在携程网上预定了丹东国际酒店2天的住宿。24日傍晚抵丹东，便打车去酒店。丹东城市不大，一说国际酒店，司机都知道。酒店在一条不起眼的小街上，周围环境一般。到总台一问，接待员说没有收到携程的预定单。我给他们看了手机收到的携程确认短信，接待员说那好吧，就按携程预定价住下吧。\n' +
                        '我说，能不能给个朝鸭绿江的房间，接待查了一下电脑，说可以，不过房间小了点，我说没关系，反正一个人住。安排的是15层（接待员还真满足了客人看江的要求），进了房间，往窗外一看，蜿蜒的鸭绿江就在眼前，朝鲜一侧的房屋和农田也清晰可见，稍远处隐约可见鸭绿江桥！房间略显旧了些，但床、被还较整洁、干净。这江景房的性价比应该是超值的！\n' +
                        '想当年国际酒店在丹东大概是数一数二的，现在来看，装修上比不上新开业的，大堂不太光亮，楼层的电梯口也只开了一小部分灯光，但服务上还不错。服务员遇到客人都会问好。特别值得一提的是23楼的旋转餐厅，可以与深圳国贸和上海新锦江顶楼的旋转餐厅相比拼！毕竟是在丹东那么一个边境小城里。20元的自助早餐较丰盛，再加上可以面对鸭绿江，饱览异国风光（尽管是农田沙洲景色）。在丹东国际酒店2天的停留还是给我留下来不错的印象。\n' +
                        '房间设备太破,连喷头都是不好用,空调几乎感觉不到,虽然我开了最大\n' +
                        '另外就是设备维修不及时,洗澡用品感觉都是廉价货,味道很奇怪的洗头液等等...\n' +
                        '总体感觉服务还可以,设备招待所水平...\n' +
                        '总体感觉不错，美中不足的是房与房之间隔音效果不太好，还有房价感觉稍高。\n' +
                        '设施虽稍陈旧一些,但良好的服务给人温暖.酒店所处地理位置和环境极好.对年龄较大的个人旅游者而言,入住该酒店不失为较佳选择.\n' +
                        '4年前住过。酒店设施这个价格还算值，尤其是黄金周期间。临海位置很好。高层，大部分房间都可以看到海。前台接待的小姐态度很生硬，登记的姓名没一个字是对的。算啦，不影响住也就不计较了。\n' +
                        '西餐厅的晚餐不错，68的自助餐，吃得捧着肚子出门。一个字，棒！\n' +
                        '早餐就差远啦！还敢号称68，一个字，汗！\n' +
                        '宾馆反馈 2008年8月14日 ： 尊敬的宾客：您好！感谢您入住金陵溧阳宾馆！并给我们留下宝贵的意见！对于早餐的问题我们将做及时的调整。我们一定会继续努力与进取，发扬金陵溧阳宾馆“以客为尊”的服务理念，让每一位宾客都能对金陵溧阳宾馆留下美好而深刻的印象。再次向您表示感谢！期待您的再次光临！祝您工作顺利！身体健康！金陵溧阳宾馆客务关系主任\n' +
                        '早餐很不错，离市中心比较近，购物方便，但是5号楼的房间相当于3星标准。不过相对于房价也值了\n' +
                        '补充点评 2008年8月11日 ： 另外，房间提供的拖鞋太小了，根本穿不下，难道是给女士设计的？我是42码的脚啊。\n' +
                        '宾馆反馈 2008年8月14日 ： 尊敬的宾客：您好！感谢您入住金陵溧阳宾馆！并及时把您的感受和意见告知我们！对于你提出的拖鞋太小的问题。等您下次入住金陵溧阳宾馆时只需向我们的服务员提出。我们将根据您的意见记录特别需求，提供您满意的服务！，发扬金陵溧阳宾馆“以客为尊”的服务理念，让每一位宾客都能对金陵溧阳宾馆留下美好而深刻的印象。再次向您表示感谢！期待您的再次光临！祝您工作顺利！身体健康！金陵溧阳宾馆客务关系主任\n' +
                        '房间稍小，但清洁，非常实惠。不足之处是：双人房的洗澡用品只有一套.\n' +
                        '宾馆反馈 2008年8月5日 ： 尊敬的宾客：您好！感谢您选择入住金陵溧阳宾馆！对于酒店双人房内的洗漱用品只有一套的问题，我们已经召集酒店相关部门对此问题进行了研究和整改。努力将我们的管理与服务工作做到位，进一步关注宾客，关注细节！再次向您表示我们最衷心的感谢！期待您能再次来溧阳并入住金陵溧阳宾馆！让我们有给您提供更加优质服务的机会！顺祝您工作顺利！身体健康！金陵溧阳宾馆客务关系主任\n' +
                        '3人间还是比较大的，就是暖气不是太暖和，时冷时热。被单会有油污的地方，不过还可以接受。洗漱间和厕所没有暖气洗澡刚开始会较冷。24小时热水、比较周到的服务、桶式饮用水还是不错的。周围环境还可以比较安静，西到西直门、动物园；北到积水潭、新街口豁口；南到西单；东到后海还是比较方便的地理位置。豁口新开的新华百货商场比较气派，还不错可以逛逛。推荐居住！\n' +
                        '该酒店对去溧阳公务或旅游的人都很适合，自助早餐很丰富，酒店内部环境和服务很好。唯一的不足是酒店大门口在晚上时太乱，各种车辆和人在门口挤成一团。\n' +
                        '补充点评 2008年5月9日 ： 房间淋浴水压不稳，一会热、一会冷，很不好调整。\n' +
                        '宾馆反馈 2008年5月13日 ： 非常感谢您选择入住金陵溧阳宾馆。您给予我们的肯定与赞赏让我们倍受鼓舞，也使我们更加自信地去做好每一天的服务工作。正是有许多像您一样的宾客给予我们不断的鼓励和赞赏，酒店的服务品质才能得以不断提升。对于酒店大门口的秩序和房间淋浴水的问题我们已做出了相应的措施。再次向您表示我们最衷心的感谢！我们期待您的再次光临！\n' +
                        '我们住的是8号五星楼，总体来讲还可以，服务还有些欠缺，退房是时间太长\n' +
                        '宾馆反馈 2008年5月6日 ： 非常感谢您入住金陵溧阳宾馆 ，并通过网站将您的入住感受与我们分享。我们宾馆始终致力于不断提升酒店的软件和硬件设备，为客人提供良好的入住环境和美好的入住体验，您的意见我们已做过专题讨论会，对于退房等一系列服务已做出改进。恭候您的再次光临！\n' +
                        '我预定了大床间，可是所谓的大床只有1.5米宽，房间倒是很大。值得推荐的是自助餐，酒店客人50元/人，还是不错的。但餐厅服务员难得见到笑容，而且不太理睬客人的招呼，不好。\n' +
                        '帮JJ定的 好像不怎么样哦 水好像差点意思\n' +
                        '补充点评 2008年3月29日 ： 我点了3分 怎么还是显示4分啊\n' +
                        '房间还可以，楼下有食街，服务态度很好！\n' +
                        '不过网络不太好，总是断线；早餐一般般。\n' +
                        '不错的酒店，房间干净，安静（15楼）。客户请客就在酒店的包房吃的，味道很好。中式早餐略有不足，没什么可选，味道还可以。\n' +
                        '住的是350的大床房,以四星标准衡量的话,家具太旧,房间太小,早餐品种单一,别的总体来说还可以吧,地段不错,服务也满好.\n' +
                        '去住的话最好是住朝向大院的房间，因为酒店后面有中央空调的一些设备，晚上响起来的话影响休息的。\n' +
                        '早餐很一般，没甚么好吃的东西。酒店旁边有条小路，那里有几家实惠的小饭店，比如私家菜甚么的。\n' +
                        '总的来说，出差宜兴，国际饭店还是第一选择。\n' +
                        '服务很热情，交通也很便利，下次如果去北京我还会选择这家酒店!\n' +
                        '入住的时候，恰逢前台的POS机坏了，只能预付现金，有些不便。不过位于一楼的餐厅真是物美价廉，值得一去。\n' +
                        '房间很清洁，洗手间装修好。早餐非常丰盛，豆腐脑很好吃！交通很方便。\n' +
                        '隔音不够好，我们的邻居夜里1点多电视声音开的很大，投诉后酒店服务人员去与隔壁邻居协商解决了。\n' +
                        '虽然表面看很一般,但里面装修还是很精致的,住着干净,舒服;以后去宜兴首选还是宜兴宾馆!\n' +
                        '整个酒店的环境、设施等都很不错，但让服务员拿份地图，却一直没拿来，价格好象比以前也高了一点。不过性价比还是令人满意的。\n' +
                        '自助早餐非常好，服务很周到，下次还会去住。\n' +
                        '前台小姑娘很有意思，经常入住，都熟了，呵呵\n' +
                        '相当于五星的服务，好于四星的早餐，差不多三星的房价\n' +
                        '就是要借东西\n' +
                        '补充点评 2008年5月12日 ： 有个印度啊三，很有派头，服务热情\n' +
                        '各方面都不错，性价比也比较高。就是有些房间内设施要打电话才送来，例如电吹风，地图等。\n' +
                        '我住的是B区，好像要档次低一些，但还可以，只是我住的房间刚好有半堵墙挡住了风景，但是我同事住的对着湖面很漂亮。\n' +
                        '健身区正在装修，所以没能去游泳和运动很遗憾。\n' +
                        '大堂满高档的。房间内饰比较朴素。早餐还行。\n' +
                        '区位也还行，虽然离漂亮的团氿还有点距离。\n' +
                        '这次入住的宜兴宾馆性价比还是比较高的，房间很大，房内布置也比较温馨。早餐品种太少了，服务员态度比较好。\n' +
                        '我是10月20日一家人入住的,北京五日游,从门童,柜台接待,餐厅服务,卫生,都比较温馨,热情,礼貌,给人一种宾至如归之感.入住,结帐都很及时,速度很快.到北京各景点交通很方便.周围的景点步行10分钟到达的有梅\n' +
                        '如家，一贯的风格，房间也是这样，怎么说，如家的价格还是比较实在，在上海住店，能干净、价格优惠就行了。。。\n' +
                        '离机场很近，房间里的床很大，里面还有一面镜子\n' +
                        '还行吧，不算失望，离地铁2号线要走500M左右，但在中环旁边，自己开车去比较方便。\n' +
                        '在携程上订了一天，实际入住两天，酒店照携程价加收了一天房费，并为我免费升级了商务房。中间问酒店前台借过指甲剪，他们说没有，建议这类的小物品还是应该提供服务方便客人。吃过一顿自助早餐，品种还算可以，就是没有牛奶，只有豆浆和咖啡。总体感觉还算可以，酒店也比较新比较干净，就是隔音比较差，经常很吵，酒店出门就有地铁和公交线，有公交直达上海动物园呵呵。还有酒店延迟退房时间没有商量余地，这个不好玩。\n' +
                        '宾馆反馈 2008年5月20日 ： 感谢您对我们酒店的评价,更加感谢您对我们提的建议。在我们如家酒店的服务规范中，指甲剪之类的租借物品前台是应该免费提供给客人方便的。对这次未能向您提供服务，给您所造成的不便，我们诚恳致歉，请您原谅！以后我们酒店会加强对此类细节的关注，不再让您失望！自助早餐每天的品种是不一样的，一般是Ａ．Ｂ．Ｃ三套互换的，饮料中牛奶、豆浆、咖啡、红茶和橙汁等几种饮料也是互换的，今后夏天我们还会增加一些冰冻冷饮。您假如需要牛奶，可以向我们的服务生提出，她们会很乐意为您服务的。，欢迎您下次光临我们如家快捷北虹路店，我们一定会让您感觉到我们一天天的进步，也希望您给我们这样的机会证明给您看！\n' +
                        '很不错的酒店。虽然离地铁站有一定距离，可是还是挺方便的。房间的床很大很舒服。但是相对的，别的空间就缩小了。。。不过我还是很喜欢那张床。。。早上服务员的声音有些响 希望可以改进下\n' +
                        '超赞！虽然窗正对中环，但一点也不觉得吵。房间很干净、整齐，给人很舒服的感觉，服务也很好，价格也不贵，非常满意！\n' +
                        '大堂不错，有四星的样子，房间的设施一般，感觉有点旧，卫生间细节不错，各种配套东西都不错，感觉还可以，有机会再去泰山还要入住。\n' +
                        '装修较旧,特别是地毯的材质颜色显得较脏,与四星的评级很不相称,门童很热情,赞一个\n' +
                        '住过好多次这家酒店了，上次来到前台，服务员能准确的报出我的名字，感觉很亲切。四星级就是不一样。\n' +
                        '而且当天服务员还给我安排了一间商务单间，房间很新，比我订的要好价格没变。\n' +
                        '说是酒店搞活动，像我们这样的商务客人都有机会享受，不错。\n' +
                        '非常不错的酒店，依山傍水，里面大片森林，散散步很不错，坐在湖边也休息也是不错的选择；房间很幽静，房间的设施很好，服务员态度也很好。\n' +
                        '不知怎么回事，一直想给泰安华侨大厦点评，却一直未成功。\n' +
                        '因为酒店的服务很好。\n' +
                        '前一段时间和同事一起去泰安爬泰山，晚上12点出发，前台的服务员告诉我们山上气温低，让我们多加件衣服。挺细心的。\n' +
                        '因为凌晨退房，走的急，钱包落在床下了。快到山脚时，酒店的服务人员给我们打电话，说捡到我们的钱包了。我们这才发现钱包丢了。当即回到酒店，记得那位值班人员叫苏秀，我们在此表示感谢。谢谢！\n' +
                        '宾馆反馈 2008年6月1日 ： 我们酒店是老牌四星级酒店，员工素质高，个个都有十几年的服务经验，对客服务在泰城数首屈一值，宾客选择我们酒店会住得温馨、安心、放心的。  '
                } else if (val == 'training-neg') {
                    this.keyword = '总体评价，风景不错，躺床上能看到如画的山山水水（景观房），但是不推荐住，因为到晚上之后就没什么可玩可做，只能去阳朔城里（其实在那里，不管什么宾馆，只要有窗，肯定能看到山水），回来还要找出租车或摩的；房间里边都没有宽带；最好自带洗漱用品；服务员还是很厚道、很淳朴的。\n' +
                        '我十一来住了两天，一进门就象给骗的感觉。进旅馆有几百米的泥路。是很普通的装饰。价格上没有一点优势。不是黄金周定房不能退我就马上走了。这里没有停车场，停车要到隔壁缴费停车。哪天有个广州车停在路边过夜给老板骂个半死。我们带了几个小孩去玩，有一点调皮。小孩给老板的妈妈骂的很刻薄。天啊！我花五百多一晚来住还要受这样的气。呵呵！真的象他的广告一样：有回家的感觉。“因为我回家总是给老妈叨唠”\n' +
                        '网上介绍的比较好，但是实际却是另一番现象。交通非常不便，晚上除非包车，否则根本没法出行；另外酒店性质为居家酒店，服务态度、服务质量比较一般，周围环境也没有传说中的那么诗意化。如果想体验农村生活的话可以一住，否则可以考虑阳朔街上一带的住宿。\n' +
                        '河南人就是河南人！不被懵一次，那算白来一回；在全国乃至全世界那种叫做经济房的房间，在河南济源雅士达叫做“贵宾楼”，真够逗的！！！\n' +
                        '房间太旧，卫生间是很多锈迹，房间比较大，大床不错，我喜欢。\n' +
                        '价格还可以，就是太旧了，不舒服，服务员水平差不多二十年前老国营的水平。\n' +
                        '下次会换一家住。不过据说小姐不错，俺没试。\n' +
                        '酒店生意清淡，大堂里都没几个客人。\n' +
                        '房间倒是不小，但觉得被褥窗帘都灰蒙蒙的有股味道，不知道多久没人用了。\n' +
                        '酒店里的娱乐设施，包括游泳池，台球等等，都要收费。\n' +
                        '白天房间里没有空调。晚上的热水，要先放10 分钟才会来。\n' +
                        '优点么，就是位置不错，出门就是老街，吃饭逛街还算方便。\n' +
                        '9月9日入住,从小事即可见一斑：浴帘比浴盆高200毫米，弄得卫生间一地水，功能丧失，不如说是遮羞布；餐厅桌布油迹斑斑，服务员总是理直气壮地回答，昨晚忘记换了。\n' +
                        '让人不可思议的是房间不能打国际长途！11日晚23时，我要打国际长途，前台首先声明不好使，建议买IC卡打（想赚卡钱吧？）。在我的坚持下开通了国际长途，但拨号后传来了中文提示：这个号码是空号......。显然没有“出国”。与前台理论，找值班经理都不解决问题，无奈，找出一张IP卡，试拨17900，无法拨通，又试拨10060（该宾馆号称用网通的电话），也不能拨通。最后用手机拨打了国际长途。\n' +
                        '电话打过，确久久不能入睡，倒不是心痛电话费过高。而是心中恐怖，万一夜里着火、被盗，我能拨打119、110吗？可爱的正宗三星级酒店！抬眼看日历，啊！9月11日--恐怖的911！！！\n' +
                        '次日提前退房离去。留下携程与你长期合作。\n' +
                        '大家都说平湖君悦酒店床铺太小，很不幸我中招了，我是预订完了之后才看到大家评价的。这家酒店的内部设施偏老，早餐不好吃，房间有点小，设施还算全，卫生间也很旧！\n' +
                        '补充点评 2008年6月3日 ： 我建议大家在平湖多走走，比君悦酒店性价比高的宾馆多得是！\n' +
                        '时隔2年又住这家宾馆，当时给了4～5分的评价，可今天再也看不到2年前正在申请3星时的服务和环境了，服务员没了微笑，早餐没了品种，设施正在老化，失望啊。\n' +
                        '通过携程定了950元三间标准间的套餐，同朋友们三家九口一起入住。由于孩子都比较小，我又直接去电酒店，要求将标房换成大床房，酒店说大床房有斜坡屋顶，可以看星星。5月2日入住酒店，总台告知“酒店没有电梯”，由于房间在三楼大家都认为可以承受，于是提着行李抗着童车背着孩子，跟着服务员去房间。走着走着才发现，原来酒店是连着的好多栋楼，我们的房间同总台隔开2栋，我们跟着服务生上了一层一拐弯，又上一层又一拐，最后还下了一个坡才到达了那个可以看星星的房间。房间大约10个平方米，一半的空间是斜顶屋檐，阳光透过两个小小的老虎窗直射进来，使这个没有凳子的房间倒也显得不是太小。由于节日期间客人刚刚退房，服务员马上给我们重新铺床。随着床单的抖动我发觉空气中飘散着无数的粉尘。然而这还只是噩梦的开始，吃了晚饭我竟然发觉自己在餐厅和客房之间迷路了，我不断的在那几栋房子之间穿越走廊、上下楼梯，大约花了15分钟之后才终于带着满身臭汗回到房间。想洗澡但发觉水管里冒出的全是锈水，问了总台迟迟没有反映，过了20分钟，我的第三个电话总算得到了这样的答案“工程部反映，锅炉没有问题，请多放水应该会好。”在继续放水15分钟锈水依旧之后，我终于在第四个电话里爆发了，随着我的骂声出现了2个工程人员以及一个服务生。他们在卫生间里干了些什么我已经无力关心，因为从发现问题到最终解决用去了将近2个小时。洗完澡我就睡着了，半夜几次被热醒，原来为了节省费用，酒店的中央空调在晚上是关掉的。我一定要告诉所有的人千万不要住这个酒店。顺便说一下，酒店所谓钓鱼的地方就是一个小水塘，里面的水已经有些幅营养化，我在旁边呆了一个下午，也没有见人钓到什么鱼；烧烤的地方苍蝇很多，还有一种小飞虫专门盯着人的眼睛钻，很另人恶心。\n' +
                        '酒店看起来设施都比较陈旧，房间里居然没有中控，非常不方便。热水到还不错。前台态度一般.\n' +
                        '属于政府招待所，酒店设施非常一般，服务态度也不太令人满意，房间的床上用品不干净，枕套居然是有大面积油渍的，换了一个居然还是一样，床单下有很多头发，被罩上还有零星的血渍，早餐质量太差，天天一样，令人没有食欲，18元的早餐也就是喝碗粥，吃个鸡蛋。希望邯郸地区的酒店能够尽量提高质量和服务水平\n' +
                        '味道太重了，晚上睡不着，希望邯郸宾馆有点公德心，装修刚好就开始营业，想毒死人啊！\n' +
                        '非常一般的酒店，完全不够4星的级别，到了才发现酒店外观和照片相差很远，不是很大。大堂很土，房间很冷，那天正好赶上下雨，入住的时候窗帘上拉上的，睡到半夜被冻醒了，早上起来才发现，原来窗户是开着的，为什么服务员不把窗户关上呢，也许是我太粗心了。洗澡的地方也不好，淋浴房很小，都伸展不开。床上的用品也很差，被子也薄。楼上的餐厅超贵，一个西红柿炒蛋要28还是38，刀磨的是相当的快呀！下次不会住了，太差了！\n' +
                        '套房面积挺大。最吃惊的是案头上放了文房四宝，差点动了留下到此一游的墨宝的念头，最后还是罢了。床很大，但被单不是太舒服。景观餐厅东西太贵，强烈不推荐。住房客人素质不高，感觉到了乡镇企业家聚会场。下次还是选择4星的吧。\n' +
                        '枕头太低了不好睡，不过在驻马店这种地方算可以了\n' +
                        '本人在江苏入住最差的一个宾馆。晚上准备洗澡居然有一群男人拿着房卡直接开门进来，说这个房间是他的，行李还在里面。我是下午入住的，房间里面没有任何东西。叫来服务员，原来人家没有退房就把人家的行李扔出去了。所以，别人的钥匙还能开我的门。恐怖！这样的管理水平谁还敢住？洗澡水不热，第二天就感冒了。早饭更是没说的，一塌糊涂，没几个菜，都是凉的。服务员态度狂差，都欠她的。这种宾馆建议携程拉入黑名单，不要出来害人了。\n' +
                        '该酒店根本就达不到星级标准,是当地工商局办的,估计就是原来的招待所,前天晚上我刚住了一晚,室外-3度,室内温度不会超过10度,更晕的是晚上12点空调关闭,网速很慢,按当地的消费水平,标准间最多就是120元的水平,可携程的预定价是180元,不值!早餐很差!\n' +
                        '本来打算在这里入住2天的，但是由于网络极差，导致本人的网络会议数度中断，严重影响工作，所以匆忙离开。\n' +
                        '对客房的映像很模糊了，唯有哪位业余的IT令我映像深刻！大堂的装修还算可以，服务员也比较热情。对于那些要求高品质网络的用户，不提倡入住。\n' +
                        '从重庆过来，机场下来已经是下午5点多了，结果房间没有打扫好， 半小时OK， 6点，还没有好，15分钟。 晕！7点， 还没有好，和总台交涉， “我也没有办法”，7点半才进房间。电梯上去走道黑啊。真不知4星怎么挂上去的？从来没有遇到这么差的4星酒店。强烈不推荐！！！\n' +
                        '环境还算可以，可能是当地饮食文化跟东莞有不同的原固，中餐分为二层，一层饮茶，一层食饭，本人想食饭的，但去错饮茶楼层，而且开了茶位，（每一种茶收十元）后来转去食饭楼层时也要把那饮茶楼层的茶位费一起结算，但我在食饭时也开了茶位啊？他们说是分开核算的，这就等于我重复交茶位费了，真气人！\n' +
                        '优点:靠近商业中心,离火车站不远,价格还算公道\n' +
                        '缺点:房间设备差,几乎就是招待所的标准,周围环境脏乱差,噪音大.烧烤气味刺鼻.\n' +
                        '浴巾是洁白新的,毛巾脏到灰黑色.被子不错,但几乎没褥子,喜欢硬板床的TZ有福了,绝对够硬.交通是秦皇岛和北戴河之间的大马路旁,评价是:路边店.\n' +
                        '不知是否抱怨携成佣金多,给的也是位置最差的2间(一层餐厅门口),实际酒店当天入住率不高,何必呢.7.8号早7:30开始钻头声大作,直到10点多我们离开.\n' +
                        '我选酒店靠评论还很少失手,这次是挂2个大眼袋浑身痛(咯的)回去的.如果各位和我一样把住宿和度假心情结合的话,最好别选.我不求硬件多好,只要干净温暖,多花点钱都愿意.以后仅记,一定要住旅游局正式挂牌的酒店!!各方面都不正规,别看照片,和实际差远了.\n' +
                        '1、房间太小，小的有点过份。所谓的可供上网的台子小的快连笔记本电脑都放不下了。我在搞电脑时，差点摔破酒店的杯子。\n' +
                        '2、此期间通过携程预订，酒店赠送精美钥匙扣。钥匙扣在哪里？好像没送。\n' +
                        '3、早餐时间8时40分要求在餐厅煎蛋的服务生，煎个鸡蛋，回答说今天煎蛋结束，我说为何？服务生告之没蛋了，我说还有二十分钟早餐才结束，为何就没蛋了，仅仅是个鸡蛋。当时想找他们经理，算了吧，还是写在这里。\n' +
                        '4、失望。下次不去再去。\n' +
                        '泰和楼房间还不错。单入住和退房手续时间太长。入住时先告诉我房间未整理好，但不能先办入住和放行李入房间（因急着有其他事情）。后来房间OK后还是用了40分钟才办好入住手续。\n' +
                        '此酒店门面很小，完全不像一个三星级酒店。入住率好像也不高，反正我住的时候，人很少。房间大小比较标准，但是光线不是很好。网络奇差无比，经常连不上。服务很一般\n' +
                        '1 房间很小，地毯很脏，白毛巾显黑色\n' +
                        '2 中央空调有异响，后半夜只好关掉\n' +
                        '3 洗澡水忽冷忽热\n' +
                        '北京机场到酒店打表205元.\n' +
                        '挂牌4星的酒店，携程说是3星--非常正确！老实说是2星还差不多。\n' +
                        '1）不是所有房间都有宽带，即使有也请先试一下，我为此在晚上换了3间房间。\n' +
                        '2）标房内没有免费的瓶装水供应。\n' +
                        '3）要打电话的请注意了：：：不管对方接听与否，20秒后开始收费！！非常奇特的规定！所以，千万要小心了。\n' +
                        '4）800免费携程电话在这家酒店是要收费的，小心！\n' +
                        '5）10800AT&T对方付费电话是要收费的，不是服务费，是按本地电话收费的，反复解释还是没有用的！！！不只是他家的电话是不是中国电信的，中国电信10000#都说是免费的啦，还是解释不通！\n' +
                        '6）房间及其陈旧，拖鞋比纸还薄，空调不热，还没有暖气设施，害得我半夜起来加被子--难以想象，这是家在伟大首都北京的挂牌4星酒店。\n' +
                        '位置相当偏僻,晚上从五环出来,该拐第一个弯的地方连路灯都没有,房间小,二楼的房间要从三楼走下去,没体会他们能提供什么服务,连出租车都不给定.绝对不建议入住.\n' +
                        '我们7人同行，订了2间标房，1间三人房，到酒店入住时告知三人房与两间标房分别在两幢楼的，三人房check in的时候又告知房间有问题，还要给了我们两间标房，房间内设施齐全，但是洗澡水放出来就象泥水，要放15分钟才干净，楼内服务台没有服务人员，总体感觉不是很满意。\n' +
                        '由于五一当天决定出去玩, 订晚了, 只有三家酒店可选择, 就选了这家.\n' +
                        '优点: 酒店在青山湖边, 房间要选临湖那面, 感觉还算清静, 酒店的绿化还算好.\n' +
                        '缺点: 房间设施太过简陋, 顶多是个普通的招待所的标准, 卫生间太简陋, 那个马桶简直脏的吓人, 不是打扫的不干净, 不知道是用了太多年还是质量太差, 整个马桶都是乌其麻黑的.\n' +
                        '不要在酒店吃饭, 太湖源, 天目山景区里有农家乐, 找停车多的那种, 价格公道, 材料新鲜, 那个土鸡汤味道真实鲜得来...\n' +
                        '硬件差：房间设施简单、陈旧，房内有较重的异味，半夜后中央空调“罢工”。\n' +
                        '服务差：进房发现，床单和被褥就简单地铺在床上，根本没有拉平整。走廊、过道、楼后场地到处是桌椅、杂物乱堆乱放的场景（看得出酒店管理、服务的基本水准）。\n' +
                        '餐饮差：办理入住手续时，总台推荐在酒店用餐（加之17087105的好评），“果断”决定不另找饭店。在点菜时就感觉不对，点菜员对鱼缸里寥寥三、四种鱼类大多不认识，对菜单上菜的烧法更是一百个“抱歉”。上桌的菜就更糟了（58元一个鱼头沙锅就是半锅汤和一堆鱼头散骨头......）。早餐要另买票不算，质量实在不敢恭维。（17087105：我的好朋友，你的点评对我们入住该地真的很关键，你可把我们“小害”了一次！）\n' +
                        '卫生差：这是最要命的一点，在离开酒店后的路上，车上的两位女士（妹妹和夫人）均出现了不雅观的动作，一个拼命抓挠手臂，一个拼命抓挠脚背，仔细一看，原来两位白嫩的皮肤上长出了一个个小红点，一开始还以为是蚊子咬的，但马上被稍有医学知识的妹夫否定了，蚊子咬的不会这么小（是啥生物咬的不言自明）。\n' +
                        '青山湖真的不是几年前的青山湖了，原来的美景被尘土飞扬、泥浆满地的房产开发工地所取代。看到几年曾经入住，且颇为满意的天乞宾馆，如今大门紧闭，人去楼空，窗门破碎，锈迹斑斑，萧条之景，让人寒心。再回头看看400多块的享受这样的度假酒店，也就不奇怪了。\n' +
                        '我每次入住一个酒店，都喜欢以褒为主，点评一下。但唯一这次，恕我直言，且毫不偏激地说一句，这样的酒店，有辱携程！\n' +
                        '补充点评 2007年5月9日 ： 过去5、6天了，妻子脚上的小红点还未消掉，前几天还奇痒无比，可见那些小红点很毒的，住这个酒店后悔死了！\n' +
                        '渡假村周围景色不错,但较落乡.硬件太差,服务水准有待提高!查房时故意用陈旧的烟蒂烫痕讹人,虽未得逞,但给人留下的感觉不好,以后不去就是了.\n' +
                        '该酒店卫生情况较差，特别是早晨6点多，我听到卫生间有两只老鼠在嘶叫，感觉特别差，硬件设施与价格不符，失望，太令人失望\n' +
                        '早上自助餐极差，脏得无法吃，居然还每人20.中餐厅服务员极差，要想吃饭，先气死。再也不会去了。\n' +
                        '房间装修比较旧，周边也没有休闲购物的地方，性价比不高。虽然说免费提供上网，但实际上网上不了，最后还要住电脑房才能上网，不适合商务出差。还要投诉一点，浴室的用具，包括沐浴露和洗发水，有些是满的，有些只有半瓶，有可能是上回用剩的，请各位入住时注意。\n' +
                        '酒店老化,房间装修差,服务过于生硬,中午退房时间过不到两小时收取半日房费，而其它酒店基本从人性化考虑，不收此项费用．\n' +
                        '刚从九华山回来，从携程订了百岁山庄，总体感觉还可以，就是满大堂飘溢着奇香，不知是什么，有些刺鼻。房间也算可以，很紧凑，设施、洗澡水也不错，可有股潮湿不通风的怪味，被单上也有不洁的痕迹。好在我们只注一天，也就将就了。\n' +
                        '房间设施还可以，但酒店内非常的冷，冬天不推荐入住。\n' +
                        '太令人失望了。通过携程预定的，应含双早，可是，总台没给餐券，餐厅要收每人10元，才上餐。浴室的龙头坏的，头天入住报修后，到第二天退房也没人修。浴帘脏得看不出本来的颜色。太差劲了。\n' +
                        '总体来说不怎么样的，进入当天需要门童帮助拿行李也是很不情愿的样子，服务员比你还要早就洗好澡了，在你对面的房间看电视。延住几天的卫生打扫也是很马虎，第二天觉得卫生间很臭还要请她们在你眼皮底下再打扫一遍。这家酒店是原来对内的招待所改建、扩大的所以很多酒店该有的实施基本上不具备的，出这个价很不值的！\n' +
                        '到半夜竟然没暖气,怎么住啊????!!!!!!!!!!\n' +
                        '房间比较差，尤其是洗手间，房间隔音和餐饮服务都不好。\n' +
                        '不好的，319房间有故臭味。要求换房说满了，我是3月去的。在路上认识了一个上海人，他说他退房前也住的319，也是一股臭味。而且这个去不掉，特别是晚上，很浓。不知道是厕所的还是窗外的。服务一般，门前有绿皮公交去莫高窟，不过敦煌宾馆也有，下次住敦煌宾馆。再也不住这个酒店了，热水要放半个小时才有。\n' +
                        '房间太小,宾馆有租四轮自行车的,很破,骑不动,后来服务员说他们的车都是东方绿舟淘汰的.酒巴装修的还可以,就是蚊子太多,象轰炸机.\n' +
                        '我去年的时候去过该酒店，那时候住的是无烟房，感觉还好，这回去住的是高级标准间，进去了房间就有一种怪味道要求前台换房，换过了以后还是多少有一点怪味。不过房间的墙壁特脏，后来想算了，就没在换，不过感觉今年的金鼎要比去年卫生环境差很多，装修也旧了！\n' +
                        '尼斯酒店的几大特点：噪音大、环境差、配置低、服务效率低。\n' +
                        '如：1、隔壁歌厅的声音闹至午夜3点许、凌晨6时起又“享受”健身操场噪音；窗户破旧不隔音。\n' +
                        '2、电视无港、澳、凤凰、英文.....等台。\n' +
                        '3、前台服务人员少（2名），在早餐前已交房卡要求结算，待早餐后仍未算出来，无任何消费，而且只有我们在结帐，住店的客人极少。如此四星？少见。\n' +
                        '建议与“凯莱酒店”(尼斯附近)签约（全国连锁），价格也实惠。\n' +
                        '盐城来了很多次，第一次住盐阜宾馆，\n' +
                        '我的确很失望\n' +
                        '整个墙壁黑咕隆咚的，好像被烟熏过一样\n' +
                        '家具非常的破旧\n' +
                        '早餐品种少的可怜，水果只有西瓜，房间的电视是90年代的\n' +
                        '价格和房间严重不成比例的宾馆\n' +
                        '还说是江曾经住过的\n' +
                        '最后才知道\n' +
                        '他当年住的是总统套房\n' +
                        '我晕\n' +
                        '如果你有好奇心\n' +
                        '倒是可以去住啊\n' +
                        '呵呵\n' +
                        '说实在的我很失望，之前看了其他人的点评后觉得还可以才去的，结果让我们大跌眼镜。我想这家酒店以后无论如何我都不会再去了。'
                }else if (val=='test') {
                    this.keyword='坐TAXI时问司机这家酒店怎么样",老酒店,人气旺,服务好,众口皆碑."\n' +
                        '到酒店时感觉很温馨,我第一次来这家酒店,服务员都很热情,像认识我一样,出差这么久了,才有家的感觉!门童冒大雨去给我找车,回家时裤子都湿了,很让我感动.\n' +
                        '房间看得出,新装修过的,家私/床上用品也都是新的,可对出差已久的人来说,家的感觉是更重要的./\n' +
                        '据说这是北海最好的三星级酒店，生意不是一般的好，人气很旺，那天晚上到的时候大堂气氛浓烈，感觉很温馨。房间的卫生间小了点，不过服务好，心里就舒畅了。我住的房间还送早餐、果篮、晚上还有巧克力，最绝的是楼层服务员告诉我网络客人还可以免费烫衣服……哇。晚上大堂副理还电话拜访我，我告诉她电视调不好，她还亲自上来帮我调。总体感觉不错，大堂副理请我帮忙宣传一下，我同意了哈哈。\n' +
                        '我和LD总共住了7天6晚，每天有2块巧克力送，酒店的早餐很好。服务员很热情，只要你出去，回来后房间就打扫。不管出去几次，这点很好，很负责！床很大，枕头也是超大的，很舒服！总体感觉不错！没有不满意的地方！\n' +
                        '1、位置：交通便利，距机场快线九龙站40港币车程，据铜锣湾时代广场80港币车程，海港城起步费车程；弥敦道步行即可，购物非常方便；\n' +
                        '2、环境：较为安静，适于居住；\n' +
                        '3、设施：维护较好，但设施已较旧，传统电视机；\n' +
                        '4、饮食：酒店早餐品种较多，令人惊喜；附近餐厅亦提供其他选择；\n' +
                        '5、服务：员工热情，主动；\n' +
                        '早餐丰富.\n' +
                        '服务人员态度不错.\n' +
                        '但是入住时发现卫生间有积水,housekeeping 来检查未有结果以为是我们的小孩子搞的,心情落差.擦干后半小时内又有积水,他们只能叫维修人员,原来是水斗的一个接头坏了.口头对不起.\n' +
                        'check in & check out比较快.\n' +
                        'Italian餐馆味道不错,服务很好.价格跟上海差不多.\n' +
                        '4楼海景不够好,应该往上层更佳.去海港城和广东道不够方便\n' +
                        '在香港的五天我把富豪东方酒店称为家，工作人员的服务态度非常好，三楼的房间是新装修的，虽然很小却相当温馨．酒店每天由收拾屋子的阿姨给免费咖啡包，红茶包享用，打个电话任何事情高效率完成．\n' +
                        '酒店周围的环境比较热闹，因为九龙城是美食天堂，所以不用担心饮食问题，周围甜品店，茶餐厅多的眼花缭乱，价格合理，服务周到．\n' +
                        '虽然离地铁不近，但是公交车四通八达，远比地铁换乘方便，酒\n' +
                        '还行,房间小是不可以抱怨的，因为这是在香港,如果是来购物的话是个不错的选择!\n' +
                        '帮家人订的,没什么好说的,香港的酒店嘛,有这样的性价比就可以了.\n' +
                        '该酒店2008年刚刚装修，室内有浓重的装修建材味道，且窗户无法打开。另外该酒店重新装修过之后改名为现在的仁民，故大多的士司机不清楚酒店的位置\n' +
                        '酒店在我最喜欢的跑马地区, 是靠山的,很舒服,不到两分钟步行时间还可以到临近的百家国际超市,那里可以购买到全球各地的新鲜美食.\n' +
                        '^_^,扯远了,酒店房间就是小了一点,大家都知道的,香港寸土寸金啦,房间小一点是没有办法的,好在酒店周围环境幽雅,安静,酒店大堂很怀旧英式风格,还有免费巴士到地铁金钟站,价格也有竞争力,总的来说还是比较满意的.\n' +
                        '交通方便，搭机场快线香港站出来坐H1直达，步行到地铁站5分钟，门口就有叮叮车；房间虽小，但干净整洁，在香港已算不错了；周边各式餐厅很多，吃饭不成问题；酒店离金紫荆广场近，早上可以步行去看升旗仪式。\n' +
                        '设施不新, 房间大小适中, 都是侧看海景, 有无烟层.\n' +
                        '早餐比较普通, 选择不多.\n' +
                        '酒店离市区比较远,不过在尖沙嘴一个小时有一班车去酒店,房间内设施比较陈旧些,但是外部环境非常好,空气也很好,出酒店不远处就有沙滩,非常适合去渡假,早餐的品种也比较丰富.下次去还会去住,那里的环境真的非常好.比如心酒店好多了.\n' +
                        '看到网友评价说最好不要3楼和5楼的房间，但是不幸还是被指定为3楼，问前台，问了还是等于白问，就是告诉你没有了。房间设施一般，洗面盆的冷水超级小，只有热水才是大的，害得我洗衣服超级不爽。\n' +
                        '服务还可以，给了小费后房间服务员立刻多给我们3瓶水。酒店最大的好处就是离DFS超级近，大包小包可以放回房间后继续去其他地方逛。\n' +
                        '我是在海洋公园玩了一天，带着疲劳的身体在金钟打的到酒店的，原来以为打的会很贵，其实也不是很贵，因为来之前就打电话问过前台的小姐，从金钟怎么到酒店。前台告诉我坐5B就能到，结果是我在金钟下了车之后，不知道在哪里找到可以坐5B的车站，所以一狠心，就打的了，也就是27元港币就可以到酒店了。到达酒店，前台的小姐语气温和，速度也还挺快的，当一切手续办好之后，轻声地告诉我：已帮你升级到行政房。那一刻心里面是狂喜。上到房间，里面还不错，虽然不是很大，但也没有想像中的小（因为之前已经去过香港几次，再小的我们也住过）窗外就是民居，也能看到海。洗手间也还挺干净。放好行李，马上下楼去找吃的，附近还有几家没关门的小店，十元一碗的云吞面在香港来说是低消费。味道也还可以。白天再下去看的时候，原来那条街是个菜市场，作为一个主妇，顺道也对比了一下价钱。才发现，原来我们的物价真的是太高了。有些东西居然和我们的是一样价钱。但，人家的收入是我们的N倍。不说了。总体来说，这家酒店，从各方面来说还行。不次如果有机会去香港的话，我也还会选择这一家酒店。不过就是觉得酒店的价格偏高了一点点（HK715）。或许是暑假的原因吧，如果平时去可能会低一点吧。而且每天的价格不一样，有点像海鲜价。\n' +
                        '房间内环境还是不错的,就是上网有点贵,12块一个小时,还有门口修路,门前环境不好\n' +
                        '酒店的位置还是不错的，附近就有地铁站可通达各处，从机场过来想省钱的话坐A31就可以了，房间面积比较大，房间设施比较全，电吹风、电冰箱、保险箱、洗漱用品、面巾纸都有，关键是屋里有一个沙发床，带小童的话很方便。服务也很到位，整体来说性价比比较高。\n' +
                        '感谢以前住过游客的点评，感觉确实不错。比想象中的房间大。卫生干净。离地铁站非常近。酒店的服务也比较到位。酒店内的自助早餐在当地来说比较超值。对面的生记粥品也推荐下，味道不错的。\n' +
                        '房间升级到了行政楼层\n' +
                        '房间很大，很舒服，很大的落地窗户\n' +
                        '以为会很远，但是如果坐九铁，真得十分方便到达\n' +
                        '很意外，香港还有这么大的房间！\n' +
                        '免费升级到行政房，每次去都住这里。\n' +
                        '设备、空间在香港来说是一流的\n' +
                        '我订的是高级间，因为不吸烟，很幸运的升级到行政楼18楼，房间很大,服务人员很亲善，比九龙酒店（房间小，服务人员没笑容）好太多，感觉很好,下次还会来帝京住的.\n' +
                        '我在6月19-21号又入住了该酒店,还是一副老样子,问前台能否换楼尘老是回答要等半小时,不知为何?望酒店在各方方面面有待提高!\n' +
                        '房间很大，服务员的态度也很好。只是商场在招商，不是很方便！\n' +
                        '一般情况吧!这个价位的能有这样的硬件条件也算不错了!\n' +
                        '适合情人约会不想花大钱的!\n' +
                        '相对价格而言，很不错。可是我订的商务大床房间隔音太差，隔壁房间电话声音、咳嗽声等清清楚楚，太没私密空间了。\n' +
                        '三人间，房间很宽敞，卫生间不大，但都很干净。三楼的胡同设计很别具匠心。只是早餐结束的时间太早.九点钟去餐厅正赶上服务员收视最后一张桌子.\n' +
                        '附近特色小吃很多. 斜对门的小饭店半夜三点多还营业, 饭菜汤面很可口,也很便宜, 只是忘记饭店的名字了.\n' +
                        '很好的酒店,床很大!卫生间的设计很好.很有艺术性!\n' +
                        '感谢入住两天那位男服务员对我的帮助\n' +
                        '谢谢!!\n' +
                        '地理位置还不错，到哪里都比较方便，\n' +
                        '但是服务不象是豪生集团管理的，比较差。\n' +
                        '下午睡了一觉并洗了一个澡，本来想让酒店再来打扫一下，所以，打开了，请打扫的服务灯，可是到晚上回酒店，发现打扫得服务灯被关掉了，而房间还是没有打扫过。\n' +
                        '我这次是第5次住在长春的雁鸣湖大酒店。昨晚夜里停电。深夜我睡着了。我的钱包被内贼进入我的房间，偷了我近1000元和4张信用卡。。。\n' +
                        '我的证件和外币，数码相机等都在房间的保险箱里，原封不动。我打了好几个小时的长途电话来处理我的信用卡的冻结。我报案了，这个4星酒店的保安摄像探头竟然坏了，没有修理！\n' +
                        '保安还查房卡入门时间，就是没有其他人在深夜进入我的房间。难道内贼不会用其他高明的方式进入吗？我的羽绒服也被这个内贼放在地上！我醒来时没有多想！近中午时我才发觉钱包少了现金和信用卡！\n' +
                        '还有，这家酒店的态度很差！没有同情心！我之前授权的2000元，我打了国际电话，银行说两天前我入酒店的2000元授权了，可是酒店的财务不领情，说中国银行没有授权。我又打了国际电话，我的银行说通过了！\n' +
                        '这家4星级的酒店不负责，认为不可能发生，我报案了，我下次再也不住这个1星不到的服务态度，很可耻！\n' +
                        '我还要把这个事件说给那些想定这个酒店的住客。酒店为何停电，摄像头坏得也太凑巧了来让大家知道这种内贼行为是要强力打击的。\n' +
                        '好了，不说了！！！ 千元丢了小事。酒店的处理态度我很反感！我强力告诉大家和提醒其他人不要到该酒店！\n' +
                        '房间还可以，比较大，但是临近马路，早上被车辆声音吵醒了，还有就是桑拿浴室不好，洗了一次澡，我和朋友损失200块钱，怀疑那里有人偷钱，如果各位朋友去，千万不要带现金。\n' +
                        '周末住了一晚，酒店周边还是可以的，出行很方便~周日去花果山景区，打车25元就可以到；\n' +
                        '房间的话设施老了，空调漏了一个晚上的水！单人间卫生间很简陋~20元的自助早餐也就5元的水平~总体来说，要求不高的话就只能随便住住的地。\n' +
                        '说是4星的，居然没有设置无烟房，实在是无语。\n' +
                        '宾馆反馈 2008年4月28日 ： 尊敬的宾客，非常感谢您入住七星商务酒店！本酒店10楼为无烟楼层客房，楼层及客房均设有明显无烟楼层标志。我们诚挚地期待您下次光临我们酒店，我们将尽量满足您的订房需求。\n' +
                        '不太好，晚上被卡拉OK的声音干扰到很晚。楼下的饭店也搞出很多污染。\n' +
                        '国庆期间住过本酒店，我的评价就是"差,实在实际太差".第一:毛巾不仅仅是旧,而是破,有一个个洞洞.第二洗浴水龙头出水小，小得可怜。第三房间噪音很大，三楼的KTV一直吵到晚上12点。第四：早餐几乎没有东西可吃。第五结帐查房动作实在太慢，我们一共等了半小时多。还有很多很多的差。可以说比不上我们宁波的二星级酒店。\n' +
                        '补充点评 2007年10月8日 ： 这样的酒店携程订，标准间居然还要420元一间。自己直接订，要580元一间。超不值！！\n' +
                        '酒店位置不是很理想，去金元购物中心还是蛮近的，大约10分钟车程，我入住的是448的房间，正赶上卫生部开会，人很多，另外，2个房间之间有一扇门，隔音效果特别不好，半夜时被隔壁的亲热声吵醒，晕\n' +
                        '这是一家相当烂的酒店，我不知道其他人是如何评价它的，对客户那种极不信任的表情以及工作作风，自以为是，狂妄自大，肆意欺骗顾客，他们根本就没把客户放在眼里，我奉劝看过此贴的朋友，千万不要住这家黑店啊！切记！！！\n' +
                        '酒店不像是五星的，最多三星标准，比较失望，两个房间的海景只能看到一个角，而且服务意识都没有，我们两个房间都忘了东西，结果都到蓬莱了还没人联系我们。打电话想让他们寄回来，结果都在踢皮球，闹了半天还得回去拿。郁闷~~\n' +
                        '某些酒店人员对待顾客不诚恳。说给你换房间，骗你说是价钱贵的房间。其实是把你的房间档次调低了。没有房间就实话实说，别骗人啊，什么态度。\n' +
                        '有些房间的隐私性也不好\n' +
                        '我感觉不行。。。性价比很差。不知道是银川都这样还是怎么的！\n' +
                        '整个房间也太小了点,所有的加一起大概才十平米左右!床单是脏的.\n' +
                        '我本来是订的220元的标间，后来告诉我只有258元的标间。只好答应、别无选择。以为在这种档次的城市，外标300多元的房间会不错，实际入住后，感觉性价比较差，设施简陋，不像能代表该市形象的窗口。空调是中央控制，房间内不可以调整，刚进房间有异味。\n' +
                        '这也是我两年来唯一遇到的在宾馆入住、还要另外缴纳10元停车费的！可能是我们少见多怪吧。优点：早餐还好，符合20元的标准。\n' +
                        '补充点评 2008年6月8日 ： 建议把地址改为“六峰路”，这样开车好找！\n' +
                        '1、热水是几乎没有 2、酒店水壶内有非常多的残余物 3、房间有浓烈的甲醛味道\n' +
                        '酒店为我订的是5001，到了晚上房间出门右转是美容美发（这大家都知道是什么店）那里小姐的声音比电视的还大，房间窗外的卡拉OK一直唱到凌晨2点，还蹦迪。\n' +
                        '最让我生气的是浴室里两条浴巾的中间居然夹着一条男人的内裤，看外观明显是使用过的，与酒店总台投诉的时候，酒店一带眼镜的女经理总是让我提出要求怎样，我能要求怎样，难道要你全额免单？这家酒店真让我心寒！从来没见过这样的酒店！！！\n' +
                        '补充点评 2008年7月2日 ： 强烈建议大家不要入住 怀仁酒店\n' +
                        '1 酒店基本需要用品没有，比如要求转换插头、水壶，也一律欠缺！欠缺理由为“由于全家酒店客房已满，所以没有任何多一个后备用品作替换”（这是酒店服务员原话）\n' +
                        '2 酒店水壶内有残余物，约一元硬币那么厚。酒店服务员竟然说“知道这个情况，但是没有办法”！\n' +
                        '3 酒店早餐很差，不像3星酒店应有水平，\n' +
                        '4 冬天的暖气空调是按需提供，不问基本不给；\n' +
                        '5 暖气跟呼噜一样，整个晚上吵到天明（因为本人天明就马上退房）；\n' +
                        '6 热水器名不符实，应该叫“水器”，因为基本不热\n' +
                        '鞋撑在云南的协议酒店少得可怜，应该下大力气多做些工作，把如家的店子也到处开一开，要不然我们这些鞋撑依赖症患者都找不到住的地方啦。\n' +
                        '和当地大多数酒店一样，上网在这里是很奢侈的，非要住商务间才有的。订房的时候鞋撑说不能刷卡，到前台却是可以刷的，还比较方便。\n' +
                        '房间里就很一般，热水是几乎没有，害得阮一家人两天没法洗澡。早餐极差，不论稀饭干饭炒饭煮饭，只要有米的地方就一定有沙子。电梯有时候停运，不晓得什么原因。\n' +
                        '楼下有超市，环境一般。可走路到洱海公园或明珠广场，都不算太远。打车到机场约40元，到大理古城一带需要大约35元。大理的出租车在城内打表，出城议价，斩客现象严重。从开发区到下关市中心人民广场一带才6块钱，刚出起步价。\n' +
                        '服务水平有待提高，退房时说不见了卫生间里纸筒里的卷纸轴，非要问阮是不是给拿走了，NND，有谁会对他们的那个烂东西感兴趣的。\n' +
                        '建议要在大理住酒店的朋友，开发区这边的酒店有很多，看起来还不错。头一晚在这里歇歇脚，然后自己再去找住的地方也可以的。\n' +
                        '相当的不好！他的城景房就是靠街的！山景房就是靠远的！没啥区别！服务态度好差！本来定的山景房未经同意换成城景房还不带电脑！\n' +
                        '这是我住过的最差的酒店，房间气味难闻，刚打了灭蚊药水，换了三个房间还是如此，服务员说：“住久了就习惯了，每个宾馆都有自己的味道。”考！我又不是来体验生活的。周围环境复杂，脏乱差。\n' +
                        '房间有异味，入住时室外低于10度，但房间的中央调只有冷风！！！！室内设施陈旧！户外声音较嘈杂！只能在大堂看到服务员！总体非常不好！应该只能算是准二星！\n' +
                        '感覺不太像酒店，像旅館。。。毛巾什麽的都比較舊\n' +
                        '唉！这个酒店真是让我失望！！！上次住就感觉不好，这次去发现床上竟然有JB毛儿！不说什么了，希望携程努力控制酒店的档次！\n'
                }

                // if(val == "1" || val == 1){
                //     this.typeScope="title";
                // }else{
                //     this.typeScope=val;
                // }
                // if(this.keyword=="" || this.keyword==undefined){
                //     return;
                // }
                // this.lawsForm.scope=this.typeScope;
                // this.exampleForm.scope=this.typeScope;
                // this.qikanForm.scope=this.typeScope;
                // this.lawsForm.keyword=this.keyword;
                // this.exampleForm.keyword=this.keyword;
                // this.qikanForm.keyword=this.keyword;
                // this.searchMethod_law(this.lawsForm);
                // this.searchMethod_exp(this.exampleForm);
                // this.searchMethod_jou(this.qikanForm);
            },
            //搜索
            getList() {
                // this.searchMethod();
                // var url = this.$route.path;
                // addSearch(this.keyword, url);

                // this.lawsForm.keyword=this.keyword;
                // this.exampleForm.keyword=this.keyword;
                // this.qikanForm.keyword=this.keyword;
                this.searchGetSegments(this.keyword);
                // this.searchMethod_exp(this.exampleForm);
                // this.searchMethod_jou(this.qikanForm);
            },
            //头补选中
            handleSelect(queryData) {
                // console.log(queryData, "----------------------------------------	-----");
            },
            searchGetSegments(data) {
                var rawdata = data.split('\n');
                var preprocess = [];
                for (var word  of  rawdata){
                    if(word.split(" ").join("").trim().length>976){
                        var segs = word.split("。").map(x=>x+"。")
                        preprocess.concat(segs);
                    }else{
                        preprocess.push(word);
                    }
                }
                //过滤空串
                this.originList = preprocess.filter(word => word.trim().length > 0 &&word.trim()!="。");
                //构造字典
                this.rawsentences.sents = this.originList.map(word => word.split(' ').join(''));
                console.log(this.rawsentences.sents)
                this.lawsShowLoad = true;
                this.axios.post(`http://192.168.4.250:8090/opinion`, this.rawsentences, {
                    headers: {_api_name: "fb_criminal", _api_version: "1.0.0", 'Access-Control-Allow-Origin': '*'}
                }).then(res => {
                    console.log('-----------------01返回数据-------------------', res);
                    this.lawsShowLoad = false;
                    if (res.data.data.opn.length > 0) {

                        this.segsList = res.data;
                        this.total_law = 1;
                    } else {
                        this.total_law = 0;
                    }
                });
            },
            searchMethod_law(data) {
                this.lawsShowLoad = true;
                this.axios.post(`/json`, data, {
                    headers: {_api_name: "fb_criminal", _api_version: "1.0.0"}
                }).then(res => {
                    // console.log('-----------------01返回数据-------------------',res);
                    this.lawsShowLoad = false;
                    if (res.data.maincontent.length > 0) {
                        this.lawsList = res.data.maincontent[0];
                        this.total_law = res.data.maincontent[0].total;
                        if (res.data.maincontent[0].pathToResult) {
                            this.total_law = 0;
                        }
                    } else {
                        this.total_law = 0;
                    }
                    this.navbarVal = res.data.navbar;
                    this.lawsNavbar = res.data.navbar;
                });
            },
            searchMethod_exp(data) {
                this.exampleShowLoad = true;
                // console.log('-----------------02参数-------------------',data);
                this.axios.post(`/json`, data, {
                    headers: {_api_name: "fb_criminal", _api_version: "1.0.0"}
                }).then(res => {
                    console.log('-----------------02返回数据-------------------', res);
                    this.exampleShowLoad = false;
                    if (res.data.maincontent.length > 0) {
                        this.exampleList = res.data.maincontent[0];
                        this.total_exp = res.data.maincontent[0].total;
                        if (res.data.maincontent[0].pathToResult) {
                            this.total_exp = 0;
                        }
                    } else {
                        this.total_exp = 0;
                    }
                    this.navbarVal = res.data.navbar;
                    this.exampleNavbar = res.data.navbar;
                });
            },
            searchMethod_jou(data) {
                this.jouralShowLoad = true;
                this.axios.post(`/json`, data, {
                    headers: {_api_name: "fb_criminal", _api_version: "1.0.0"}
                }).then(res => {
                    console.log('-----------------03返回数据-------------------', res);
                    this.jouralShowLoad = false;
                    if (res.data.maincontent.length > 0) {
                        this.journalList = res.data.maincontent[0];
                        this.total_jou = res.data.maincontent[0].total;
                        if (res.data.maincontent[0].pathToResult) {
                            this.total_jou = 0;
                        }
                    } else {
                        this.total_jou = 0;
                    }
                    this.navbarVal = res.data.navbar;
                    this.journalNavbar = res.data.navbar;

                });
            },

            selectIndex(index) {
                this.choseType_law = index;
                this.lawsForm.index = index;
                this.lawsForm.page = 1;
                this.searchMethod_law(this.lawsForm);
            },
            selectIndex_ex(index) {
                this.choseType_ex = index;
                this.exampleForm.index = index;
                this.exampleForm.page = 1;
                this.searchMethod_exp(this.exampleForm);
            },
            selectIndex_jou(index) {
                console.log(111111111111111111),
                    this.choseType_jou = index;
                this.qikanForm.index = index;
                this.qikanForm.page = 1;
                this.searchMethod_jou(this.qikanForm);
            },
            handleSizeChange(val) {
                //一页几条
                this.lawsForm.size = val;
                this.searchMethod_law(this.lawsForm);
                $(document).scrollTop($("#lawsNew_wrap_main").offset().top);
            },
            handleCurrentChange(val) {
                //页码更改
                this.lawsForm.page = val;
                this.searchMethod_law(this.lawsForm);
                $(document).scrollTop($("#lawsNew_wrap_main").offset().top);
            },
            handleSizeChange_exp(val) {
                //一页几条
                this.exampleForm.size = val;
                this.searchMethod_exp(this.exampleForm);
                $(document).scrollTop($("#example_wrap_main").offset().top);
            },
            handleCurrentChange_exp(val) {
                //页码更改
                this.exampleForm.page = val;
                this.searchMethod_exp(this.exampleForm);
                $(document).scrollTop($("#example_wrap_main").offset().top);
            },
            handleSizeChange_jou(val) {
                //一页几条
                this.qikanForm.size = val;
                this.searchMethod_jou(this.qikanForm);
                $(document).scrollTop($("#journal_wrap_main").offset().top);
            },
            handleCurrentChange_jou(val) {
                //页码更改
                this.qikanForm.page = val;
                this.searchMethod_jou(this.qikanForm);
                $(document).scrollTop($("#journal_wrap_main").offset().top);
            },
            clickMoreMethod() {
                //点击查看更多
                this.lawsShow = true;
            },
            clickMoreMethod_exp() {
                this.exampleShow = true;
            },
            clickMoreMethod_jou() {
                this.jouralShow = true;
            },
            menu() {
                this.scroll = document.documentElement.scrollTop || document.body.scrollTop;
                if (this.scroll > 230) {
                    // console.log(this.scroll,'ddddddddddd')
                    this.navBarFixed = true;
                } else {
                    // console.log(this.scroll,'juli')
                    this.navBarFixed = false;
                }
                // console.log(this.scroll,'距离变化')
                let oneTop = $("#lawsNew_wrap_main").offset().top - 10;
                let twoTop = $("#example_wrap_main").offset().top - 10;
                let threeTop = $("#journal_wrap_main").offset().top - 10;
                // console.log(oneTop,twoTop,threeTop)
                if (this.scroll >= oneTop && this.scroll < twoTop) {
                    $("#1").addClass('active').siblings().removeClass('active');
                } else if (this.scroll >= twoTop && this.scroll < threeTop) {
                    $("#2").addClass('active').siblings().removeClass('active');
                } else if (this.scroll >= threeTop) {
                    $("#3").addClass('active').siblings().removeClass('active');
                } else {
                    $("#0").addClass('active').siblings().removeClass('active');
                }
            },
            goToAim(e) {
                if ($(e.target).attr('class') == 'el-timeline-item__content') {
                    let val = $(e.target).parents(".el-timeline-item").attr('id');
                    $(e.target).parents(".el-timeline-item").addClass('active').siblings().removeClass('active');
                    if (val == '1') {
                        $(document).scrollTop($("#lawsNew_wrap_main").offset().top);
                    } else if (val == '2') {
                        $(document).scrollTop($("#example_wrap_main").offset().top);
                    } else if (val == '3') {
                        $(document).scrollTop($("#journal_wrap_main").offset().top);
                    } else {
                        $(document).scrollTop(0);
                    }
                }
            },
        },
        watch: {},
        mounted() {
            window.addEventListener('scroll', this.menu);
        },
    };
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style>
  .onstopSearch_left_nav {
    border: 1px solid #a9c4df;
    width: 208px;
  }

  .nav_left_wrap.onstopSearch_left_nav .el-timeline-item.active .el-timeline-item__content {
    color: #165ac6 !important;
  }

  .nav_left_wrap.onstopSearch_left_nav .el-timeline-item__tail {
    position: absolute;
    left: 20px;
    height: 120%;
    border-left: 2px solid #4084f0;
  }

  .nav_left_wrap.onstopSearch_left_nav .el-timeline-item__content {
    text-align: left;
    padding-left: 10px;
    font-size: 16px;
    color: #2d405e;
    cursor: pointer;
  }

  .nav_left_wrap.onstopSearch_left_nav .el-timeline-item__content:hover {
    color: #165ac6;
  }

  .nav_left_wrap.onstopSearch_left_nav .el-timeline-item__node--normal {
    left: 15px;
    width: 12px;
    height: 12px;
    top: 2px;
  }

  .nav_left_wrap.onstopSearch_left_nav .el-timeline {
    margin: 20px 0;
  }


  #label_daohang {
    border-top: 2px solid #a8bdce;
    background-color: #daedfb;
    /* font-weight: bold; */
    font-style: normal;
    font-size: 16px;
    text-align: left;
    padding-left: 15px;
    height: 38px;
    line-height: 38px;
    color: #2d405e;
  }

  .onstopmain {
    padding: 0 !important;
    margin-left: 20px;
  }

  .nerong_wrap {
    min-height: 200px;
  }

  .content_main_wrap .lawsNew_wrap,
  .content_main_wrap .example_wrap,
  .content_main_wrap .journal_wrap {
    border: 1px solid #a9c4df;
    box-sizing: border-box;
    margin-bottom: 20px;
  }

  .clickMore {
    margin: 20px 0 0 0;
  }

  .clickMore button {
    width: 300px;
  }

  .list_wrap_main {
    padding: 0 20px 20px 20px;
  }

  .onestoptxt {
    margin-right: 5px;
    display: inline-block;
    height: 100%;
    /* vertical-align: text-bottom;
     */
    line-height: 40px;
    float: left;
  }

  .fagui_bian_wrap_lin {
    display: inline-block;
    font-weight: 400;
    font-style: normal;
    font-size: 13px;
    color: #879bba;
    line-height: 40px;
    height: 40px;
    display: inline-block;
    cursor: pointer;
    margin-left: 15px;
  }

  .fagui_bian_wrap_lin a {
    font-size: 13px;
    color: #879bba;
  }

  .fagui_bian_wrap_lin a:hover {
    color: #4da0fb;
  }

  .no_data_wrap {
    padding: 50px;
    box-sizing: border-box;
  }

  .no_data_wrap img {

  }

  .no_data_wrap .one {

  }

  .no_data_wrap .two {
    color: #879bba;
    font-size: 13px;
  }

  /* 模态框 */
  .el-dialog__header {
    padding: 0;
    height: 40px;
    background-color: #4084f0;
    line-height: 40px;
    color: #ffffff;
    text-align: left;
    padding-left: 15px;
  }

  .el-dialog__header span {
    color: #ffffff;
    font-size: 16px;
  }

  .el-dialog__header .el-dialog__headerbtn {
    top: 0;
    width: 40px;
    height: 40px;
    right: 0;
  }

  .el-dialog__header .el-dialog__headerbtn:hover {
    background-color: #f5b923;
    color: #ffffff;
  }

  .el-dialog__headerbtn:hover .el-dialog__close {
    color: #ffffff;
  }

  .el-dialog {
    border-radius: 5px;
    overflow: hidden;
  }

  .el-dialog__header .el-dialog__headerbtn i {
    font-size: 14px;
    color: #c4dcf4;
  }

  /* 模态框 */
  .jians_conditions {
    color: #5c79b0;
    font-size: 14px;
    width: 96%;
    margin: 0 auto;
    /* margin-bottom: 5px; */
    margin-top: 10px;
    overflow: hidden;
  }

  .center_el_main {
    padding: 0;
    margin-left: 10px;
    border: 1px solid #a9c4df;
  }

  .jians_conditions_wrap {
    min-height: 32px;
    border-bottom: 1px solid #a9c4df;
  }

  .conditions_left,
  .conditions_icon_clean,
  .conditions_right {
    float: left;
  }

  .conditions_left {
    width: 6%;
    text-align: left;
  }

  .conditions_right {
    width: 88%;
    text-align: left;
  }

  .conditions_right li {
    display: inline-block;
    color: #879bba;
    font-size: 12px;
    border: 1px solid #879bba;
    border-radius: 4px;
    padding: 3px 10px;
    margin-right: 5px;
    margin-bottom: 8px;
  }

  .conditions_right li .error_item {
    margin-left: 5px;
    font-size: 14px;
    cursor: pointer;
  }

  .conditions_icon_clean {
    width: 5%;
    cursor: pointer;
    font-size: 13px;
    color: #409eff;
  }

  .center_wrap {
    padding: 10px;
  }

  ul {
    padding: 0;
    margin: 0;
    list-style: none;
  }

  .radio_main_wrap ul {
    text-align: left;
    padding-left: 120px;
    margin-bottom: 10px;
  }

  .radio_main_wrap ul li {
    display: inline-block;
  }

  .radio_qing_mo a {
    color: #879bba;
    font-size: 13px;
  }

  .radio_main_wrap ul li.fuzzy_wrap {
    height: 17px;
    border-right: 1px solid #cad0d7;
    margin: 0 15px;
  }

  .el-radio {
    color: #879bba !important;
    margin-right: 20px;
  }

  #onestopSearch .search_input_wrap {
    width: 89% !important;
  }

  #onestopSearch .search_select_wrap {
    width: 110px;
    background-color: #ffffff !important;
    /* border: 1px solid #a9c4df; */
    margin: 0;
  }

  #onestopSearch .el-input-group__prepend {
    padding: 0;
    border-radius: 0;
    border-top-left-radius: 4px;
    border-bottom-left-radius: 4px;
    overflow: hidden;
    /* border: 1px solid #a9c4df; */
  }

  #onestopSearch .search_select_wrap .el-input__inner {
    padding: 0 10px;
    text-align: center;
    height: 38px;
    /* border: none; */
  }

  .el-input__inner {
    /* border: 1px solid #a9c4df; */
    color: #879bba !important;
  }

  .el-select-dropdown__item {
    color: #879bba !important;
  }

  .el-tree-node__content {
    padding-right: 20px;
  }

  .total_wrap {
    color: #7a7a7a;
    font-size: 14px;
    text-align: left;
    border-bottom: 1px solid #a9c4df;
    padding: 10px;
  }

  .total_wrap span {
    color: #409eff;
  }

  .search_inpu_one {
    margin: 20px 0;
  }

  .el-menu--horizontal li.is-active {
    color: #4084f0 !important;
  }

  .el-menu-vertical-demo.el-menu--horizontal.el-menu li {
    height: 40px !important;
    line-height: 40px !important;
    color: #5c79b0 !important;
  }

  .el-menu-vertical-demo.el-menu--horizontal.el-menu li .el-submenu__title, .el-menu-vertical-demo.el-menu--horizontal.el-menu li .el-submenu__title i {
    height: 40px;
    line-height: 43px;
    border-bottom: none !important;
    color: #5c79b0 !important;
    font-size: 16px;
  }

  .el-menu-vertical-demo.el-menu--horizontal.el-menu li.is-active {
    color: #165ac6 !important;
    border-bottom: 2px solid #165ac6 !important;
  }

  .content_wrap {
    border: 1px solid #a9c4df;
    background-color: #ffffff;
    margin-bottom: 20px;
    /* max-width: 1460px; */
  }

  #filerSelect {
    padding: 15px 10px;
    text-align: left;
    border-bottom: 1px solid #a9c4df;
    font-size: 14px;
    color: #879bba;
  }

  #filerSelect .el-select {
    padding-right: 18px;
    margin-bottom: 10px;
  }

  #textExample {
    border-top: 2px solid #a8bdce;
    background-color: #daedfb;

    /* font-weight: bold; */
    font-style: normal;
    font-size: 16px;
    text-align: left;
    padding-left: 15px;
    height: 38px;
    line-height: 38px;
    color: #2d405e;
  }

  #lawsNew .el-select .el-input {
    width: 130px;
  }

  #lawsNew .input-with-select .el-input-group__prepend {
    background-color: #fff;
  }

  #lawsNew .row-bg {
    padding: 15px 0;
  }

  .tab_nav_wrap .el-menu--horizontal {
    padding: 0 10px;
    border-bottom: solid 1px #a9c4df;
  }

  #lawsNew .el-container {
    height: 100%;
  }

  #lawsNew .el-row .el-row {
    text-align: left;
    margin-left: 10px;
    margin-top: 48px;
  }

  #lawsNew .el-container .el-header {
    padding: 0;
    box-sizing: border-box;
    width: 100%;
    height: 200px !important;
  }

  #lawsNew .el-header #lawsNewDiv {
    color: #333;
    text-align: left;
    line-height: 40px;
    height: 40px;
    border-bottom: 1px solid #a8a9aa;
    padding-left: 10px;
    box-sizing: border-box;
    margin-bottom: 10px;
  }

  #lawsNewDiv span {
    display: inline-block;
    padding: 10px 10px 0;
    height: 40px;
    border-bottom: 2px solid #0171b1;
    font-weight: 700;
    font-style: normal;
    font-size: 18px;
    color: #0171b1;
    text-align: center;
    box-sizing: border-box;
  }

  #onestopSearch .el-aside {
    background-color: #e3f1fa;
    color: #4f4f8a;
    text-align: left;
    height: calc(100% - 20px);
    width: calc(100% - 20px);
    margin: 10px;
  }

  #onestopSearch .el-main {
    color: #4f4f8a;
    height: calc(100% - 20px);
    width: calc(100% - 20px);
    margin: 10px 0;
    border: 1px solid #ccc;
  }


  .filerSelect_ul {
    overflow: hidden;
  }

  .filerSelect_ul li {
    float: left;
  }

  .filerSelect_ul li .el-select {
    margin-bottom: 0px !important;
    width: 120px;
  }

  .filerSelect_ul li .el-select .el-input__inner {
    height: 35px;
    line-height: 35px;
  }

  .filerSelect_ul li .el-select .el-input__icon {
    line-height: 35px;
  }

  #dialog-two .el-form-item label {
    width: 115px !important;
  }

  #dialog-two .eagn_label label {
    width: 80px !important;
  }
</style>
<style scoped>
  .breadcrumb {
    clear: both;
    font-size: 12px;
    padding-left: 10px;
    height: 40px;
    line-height: 40px;
    color: #879bba;
    text-align: left;
    border-bottom: 1px solid #a9c4df;
    border-top: 1px solid #a9c4df;
  }

  .breadcrumb span {
    padding-left: 10px;
  }

  .breadcrumb a {
    cursor: pointer;
    color: #879bba;
    padding-left: 10px;
  }

  .breadcrumb a:hover {
    cursor: pointer;
    color: #218fc4;
  }

  #lawsNew {
    width: 100%;
    min-height: 100%;
    border: 1px solid #797979;
    background-color: #fff;
    box-sizing: border-box;
  }

  #lawsNewWrap {
    width: 100%;
    height: 100%;
    padding: 2%;
    box-sizing: border-box;
  }

  .advancedRetrieval {
    font-weight: 400;
    font-style: normal;
    font-size: 13px;
    color: #879bba;
    line-height: 40px;
    height: 40px;
    display: inline-block;
    cursor: pointer;
  }

  .advancedRetrieval:hover {
    color: #4da0fb;
  }

  #advancedRetrieval {
    float: right;
    text-align: right;
    padding-right: 20px;
  }

  .ckxq_wrap {
    text-align: right;
    margin: 0;
    margin-bottom: 10px;
  }

  .ckxq_wrap a {
    color: #82a6df !important;
  }

  .ckxq_wrap a:hover {
    color: #4f5e7b !important;
  }
</style>
<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>

  .contentTitle_onestop a {
    color: #4f5e7b;
  }

  .contentCon {
    color: #879bba;
    font-size: 14px;
    margin: 10px 0;
  }

  .contentConcrijournal {
    color: #219CD4;
  }

  .contentConcrijournal span {
    color: #999;
  }

  .pagination_onestop {
    text-align: center;
    padding-top: 40px;
    margin-bottom: 20px;
    padding-left: 15px;
  }

  .red {
    color: red;
  }

  .content_mian_wrap_one {
    padding: 20px 60px 20px 30px;
    box-sizing: border-box;
    border-bottom: 1px dashed #a9c4df;
    text-align: left;
    position: relative;
  }

  .circle {
    position: absolute;
    left: 15px;
    top: 30px;
    display: block;
    width: 8px;
    height: 8px;
    border: 1px solid #a7a7a7;
    border-radius: 50%;
  }

  .contentTitle_onestop {
    line-height: 30px;
  }

  .content_mian_wrap_one a {
    text-decoration: none;
    color: #4f5e7b;
    text-align: left;
    outline: none;
  }

  .contentCon_display {
    display: inline-block;
  }
</style>
<style scoped>
  .textarea >>> .el-textarea__inner {
    font-family: "Microsoft" !important;
    font-size: 20px !important;
  }
</style>
